{
  "irVersion": "1.0",
  "project": "polymarket-go",
  "repository": "https://github.com/grokify/polymarket-go",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.3.0",
      "date": "2026-05-18",
      "highlights": [
        { "description": "REST API server with Huma and Chi for HTTP API with automatic OpenAPI generation" },
        { "description": "GraphRAG for relationship-aware market retrieval with knowledge graph traversal" },
        { "description": "Resilience patterns including retry with exponential backoff and circuit breakers" },
        { "description": "Structured error types for programmatic error handling across all packages" }
      ],
      "added": [
        { "description": "REST API server with Huma framework and Chi router", "commit": "8d07607" },
        { "description": "GraphRAG for relationship-aware retrieval with knowledge graph traversal", "commit": "91c1c32" },
        { "description": "Retry with exponential backoff and circuit breaker resilience patterns", "commit": "3b46407" },
        { "description": "RAG-based filtering and chunk processing for events and markets", "commit": "9feee3f" },
        { "description": "News and web search integration via omniserp", "commit": "e91cd49" },
        { "description": "`ask` CLI command for ad-hoc LLM queries with streaming support", "commit": "62e916c" },
        { "description": "Structured error types package with retryable and HTTP status interfaces", "commit": "09d6555" }
      ],
      "changed": [
        { "description": "Renamed omnillm-langchaingo to langchaingo-omnillm", "commit": "aeeb09c" },
        { "description": "Updated omniretrieve import path to plexusone organization", "commit": "8a8f1c4" }
      ],
      "fixed": [
        { "description": "Resolved golangci-lint issues (gofmt, ineffassign, unused)", "commit": "3c7631d" }
      ],
      "documentation": [
        { "description": "Architecture Decision Records (ADRs) for key design decisions", "commit": "e3a3310" },
        { "description": "Restructured docs/design to docs/specs for better organization", "commit": "d4a9cca" },
        { "description": "Updated documentation for REST server and new features", "commit": "b49871f" },
        { "description": "Added UTF8 icons to README features section", "commit": "81c38d6" }
      ],
      "tests": [
        { "description": "Unit tests for resilience, server, and news packages", "commit": "fe56004" },
        { "description": "Unit tests for RAG store and tools packages", "commit": "184201f" },
        { "description": "Unit tests for prompts, graphrag, and embedder packages", "commit": "6e161c6" }
      ],
      "dependencies": [
        { "description": "omniagent v0.8.0", "commit": "35998aa" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-04-27",
      "highlights": [
        { "description": "OmniAgent integration via compiled skill wrapper" },
        { "description": "Full Polymarket SDK integration for trading support" },
        { "description": "Cobra CLI with subcommand structure and superforecaster analysis" }
      ],
      "added": [
        { "description": "Compiled skill wrapper implementing `compiled.Skill` interface", "commit": "5571086" },
        { "description": "`get_markets` tool for fetching prediction markets with filters", "commit": "5571086" },
        { "description": "`get_orderbook` tool for order book analysis", "commit": "5571086" },
        { "description": "`--analyze` CLI flag for superforecaster market analysis", "commit": "be18dab" },
        { "description": "Superforecaster and trade analysis prompts", "commit": "2a82dae" },
        { "description": "polymarket-go-sdk integration for full trading support", "commit": "ed4c673" }
      ],
      "changed": [
        { "description": "Migrated CLI to Cobra with subcommand structure", "commit": "b80132d" }
      ],
      "tests": [
        { "description": "Unit tests for skill interface compliance and tool definitions", "commit": "5571086" }
      ],
      "dependencies": [
        { "description": "omniagent v0.7.0 for compiled skill support", "commit": "e92ef55" },
        { "description": "omniskill v0.7.0 for tool definitions", "commit": "e92ef55" },
        { "description": "polymarket-go-sdk v1.1.2", "commit": "ea892fd" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-04-13",
      "highlights": [
        { "description": "Go SDK for building AI trading agents on Polymarket prediction markets" },
        { "description": "Multi-agent workflow system with portable specs deployable to Claude Code or Go servers" }
      ],
      "added": [
        { "description": "Polymarket API client for Gamma (markets) and CLOB (trading) APIs", "commit": "292c38b" },
        { "description": "`GetMarkets()` to fetch active prediction markets with filtering", "commit": "292c38b" },
        { "description": "`GetOrderBook()` to fetch order book data for tokens", "commit": "292c38b" },
        { "description": "`GetPrice()`, `GetMidPrice()`, `GetSpread()` for price data", "commit": "292c38b" },
        { "description": "Multi-agent-spec loader for YAML frontmatter markdown agents", "commit": "292c38b" },
        { "description": "Team and deployment JSON configuration parsers", "commit": "292c38b" },
        { "description": "Workflow executor with DAG-based topological sort", "commit": "292c38b" },
        { "description": "LangChainGo integration via omnillm-langchaingo adapter", "commit": "292c38b" },
        { "description": "Agent tools: MarketTool, OrderBookTool, PlaceOrderTool", "commit": "292c38b" },
        { "description": "Three agent specs: market-analyst, superforecaster, trader", "commit": "a2654cc" },
        { "description": "Graph workflow: discover → forecast → execute", "commit": "a2654cc" },
        { "description": "Deployment configs for Go server and Claude Code", "commit": "a2654cc" },
        { "description": "`polymarket-agent` CLI with --demo flag for live market data", "commit": "f310251" }
      ],
      "documentation": [
        { "description": "Technical Requirements Document (TRD.md)", "commit": "1b0d22e" },
        { "description": "Component Integration Guide (COMPONENTS.md)", "commit": "1b0d22e" },
        { "description": "README with architecture diagram and quick start guide" }
      ],
      "tests": [
        { "description": "Integration tests for Polymarket API client", "commit": "292c38b" },
        { "description": "Unit tests for agent/team/deployment loaders", "commit": "292c38b" },
        { "description": "Unit tests for workflow topological sort and execution", "commit": "292c38b" }
      ],
      "dependencies": [
        { "description": "omnillm-core v0.15.0 for LLM provider abstraction", "commit": "6d698f8" },
        { "description": "omnillm-langchaingo v0.1.0 for LangChainGo integration", "commit": "6d698f8" },
        { "description": "langchaingo v0.1.14 for chains and agents", "commit": "6d698f8" }
      ]
    }
  ]
}
